Soap/gsoap/src/EdlProviderBinding.getEdl.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:fimstime="http://baseTime.fims.tv"
  xmlns:fimsdescription="http://description.fims.tv"
  xmlns:fims="http://base.fims.tv"
  xmlns:edlprovider="http://temp/edlprovider">
 <SOAP-ENV:Body>
   <edlprovider:getEdlRequest>
    <edlFramesPerSecond numerator="" denominator="">0</edlFramesPerSecond>
    <edlType></edlType>
    <clips>
     <clips>
      <markIn>
       <fimstime:timecode></fimstime:timecode>
      </markIn>
      <markOut>
       <fimstime:timecode></fimstime:timecode>
      </markOut>
      <clipInfo>
       <fims:bmContents>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
         </fims:descriptions>
         <fims:status>
          <fims:status>new</fims:status>
          <fims:resourceID></fims:resourceID>
         </fims:status>
         <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
         <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
         <fims:isFullyPopulated>false</fims:isFullyPopulated>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
         </fims:notifyAt>
         <fims:ExtensionGroup>
         </fims:ExtensionGroup>
         <fims:ExtensionAttributes>
         </fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
        </fims:bmContent>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
         </fims:descriptions>
         <fims:status>
          <fims:status>new</fims:status>
          <fims:resourceID></fims:resourceID>
         </fims:status>
         <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
         <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
         <fims:isFullyPopulated>false</fims:isFullyPopulated>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
         </fims:notifyAt>
         <fims:ExtensionGroup>
         </fims:ExtensionGroup>
         <fims:ExtensionAttributes>
         </fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
        </fims:bmContent>


       </fims:bmContents>
       <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
       <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
       <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
       <fims:isFullyPopulated>false</fims:isFullyPopulated>
       <fims:notifyAt>
        <fims:replyTo></fims:replyTo>
        <fims:faultTo></fims:faultTo>
       </fims:notifyAt>
       <fims:ExtensionGroup>


       </fims:ExtensionGroup>
       <fims:ExtensionAttributes>
       </fims:ExtensionAttributes>
       <fims:resourceID></fims:resourceID>
       <fims:revisionID></fims:revisionID>
       <fims:location></fims:location>
      </clipInfo>
     </clips>
     <clips>
      <markIn>
       <fimstime:timecode></fimstime:timecode>
      </markIn>
      <markOut>
       <fimstime:timecode></fimstime:timecode>
      </markOut>
      <clipInfo>
       <fims:bmContents>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
         </fims:descriptions>
         <fims:status>
          <fims:status>new</fims:status>
          <fims:resourceID></fims:resourceID>
         </fims:status>
         <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
         <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
         <fims:isFullyPopulated>false</fims:isFullyPopulated>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
         </fims:notifyAt>
         <fims:ExtensionGroup>
         </fims:ExtensionGroup>
         <fims:ExtensionAttributes>
         </fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
        </fims:bmContent>
        <fims:bmContent>
         <fims:bmContentFormats>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
          <fims:bmContentFormat>
           <fims:resourceID></fims:resourceID>
          </fims:bmContentFormat>
         </fims:bmContentFormats>
         <fims:descriptions>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
          <fims:description>
           <fims:resourceID></fims:resourceID>
          </fims:description>
         </fims:descriptions>
         <fims:status>
          <fims:status>new</fims:status>
          <fims:resourceID></fims:resourceID>
         </fims:status>
         <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
         <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
         <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
         <fims:isFullyPopulated>false</fims:isFullyPopulated>
         <fims:notifyAt>
          <fims:replyTo></fims:replyTo>
          <fims:faultTo></fims:faultTo>
         </fims:notifyAt>
         <fims:ExtensionGroup>
         </fims:ExtensionGroup>
         <fims:ExtensionAttributes>
         </fims:ExtensionAttributes>
         <fims:resourceID></fims:resourceID>
         <fims:revisionID></fims:revisionID>
         <fims:location></fims:location>
        </fims:bmContent>


       </fims:bmContents>
       <fims:resourceCreationDate>2015-02-05T21:42:27Z</fims:resourceCreationDate>
       <fims:resourceModifiedDate>2015-02-05T21:42:27Z</fims:resourceModifiedDate>
       <fims:serviceGeneratedElement>false</fims:serviceGeneratedElement>
       <fims:isFullyPopulated>false</fims:isFullyPopulated>
       <fims:notifyAt>
        <fims:replyTo></fims:replyTo>
        <fims:faultTo></fims:faultTo>
       </fims:notifyAt>
       <fims:ExtensionGroup>


       </fims:ExtensionGroup>
       <fims:ExtensionAttributes>
       </fims:ExtensionAttributes>
       <fims:resourceID></fims:resourceID>
       <fims:revisionID></fims:revisionID>
       <fims:location></fims:location>
      </clipInfo>
     </clips>
    </clips>
    <edlSequenceName></edlSequenceName>
   </edlprovider:getEdlRequest>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
